10/data/attachments/a1a3432203aa6a2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d6f7e3ce-c392-4fac-b951-4a2e2c4aff44</nif:username>
            <nif:friendToBeAdded>Brandon_wrong_Actions_4641_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>